kasanari/pes-visualizer-equalizer/skeleton-stm3220g/Utilities/STM32_Audio/STM324x7I_EVAL/stm324x7i_audio_codec.c
    /* Initialize the I2C peripheral */
    I2C_Init(CODEC_I2C, &I2C_InitStructure);
  }
}

/**
  * @brief Restore the Audio Codec control interface to its default state.
  *        This function doesn't de-initialize the I2C because the I2C peripheral
  *        may be used by other modules.
  * @param  None.
  * @retval None.
  */
static void Codec_CtrlInterface_DeInit(void)
{
  /* Disable the I2C peripheral */ /* This step is not done here because 
     the I2C interface can be used by other modules */
  /* I2C_DeInit(CODEC_I2C); */
}

/**
  * @brief  Initializes the Audio Codec audio interface (I2S)
  * @note   This function assumes that the I2S input clock (through PLL_R in 
  *         Devices RevA/Z and through dedicated PLLI2S_R in Devices RevB/Y)
  *         is already configured and ready to be used.    
  * @param  AudioFreq: Audio frequency to be configured for the I2S peripheral. 
  * @retval None.
  */
void Codec_AudioInterface_Init(uint32_t AudioFreq, uint32_t ExtClk)
{
#ifdef USE_I2S_DYNAMIC_INIT
  uint32_t plli2sN = 344, plli2sR = 2, pllm = 1;   
  uint32_t I2SSrcClkVal = ExtClk;
  
  /* Verify the current value of the external clock */
  if (ExternalClockVal != ExtClk)
  {
    ExternalClockVal = ExtClk;
  }
  
  /* Compute the PLL parameters */
  if (ExtClk == 0)
  {
    /* Get the PLLM value */
    pllm = (uint32_t)(RCC->PLLCFGR & RCC_PLLCFGR_PLLM);

    switch (AudioFreq)
    {
    case 96000:
      plli2sN = 344;
      plli2sR = 2;
      I2SSrcClkVal = (uint32_t)(((HSE_VALUE / pllm) * plli2sN) / plli2sR);   
      break;
      
    case 48000:
      plli2sN = 344;
      plli2sR = 2;
      I2SSrcClkVal = (uint32_t)(((HSE_VALUE / pllm) * plli2sN) / plli2sR); 
      break;
      
    case 32000:
      plli2sN = 213;
      plli2sR = 2;
      I2SSrcClkVal = (uint32_t)(((HSE_VALUE / pllm) * plli2sN) / plli2sR);
      break;
      
    case 44100:
      plli2sN = 271;
      plli2sR = 2;
      I2SSrcClkVal = (uint32_t)(((HSE_VALUE / pllm) * plli2sN) / plli2sR); 
      break;
      
    case 44000:
      plli2sN = 383;
      plli2sR = 2;
      I2SSrcClkVal = (uint32_t)(((HSE_VALUE / pllm) * plli2sN) / plli2sR); 
      break;
      
    default: /* Use 96 KHz configuration */
      plli2sN = 344;
      plli2sR = 2;
      I2SSrcClkVal = (uint32_t)(((HSE_VALUE / pllm) * plli2sN) / plli2sR); 
      break;     
    }  
  }
#endif /* USE_I2S_DYNAMIC_INIT */
  
  /* Enable the CODEC_I2S peripheral clock */
  RCC_APB1PeriphClockCmd(CODEC_I2S_CLK, ENABLE);
  RCC->APB1ENR |= RCC_APB1Periph_SPI2 | RCC_APB1Periph_SPI3;

  /* Reset CODEC_I2S peripheral */
  I2S_Cmd(CODEC_I2S, DISABLE);
  SPI_I2S_DeInit(CODEC_I2S);  
  
  if (ExtClk)
  {
    RCC->CFGR |= (uint32_t)RCC_CFGR_I2SSRC;
  }
  else
  {
    /* Disable PLLI2S */
    RCC->CFGR |= RCC_CFGR_I2SSRC;
    RCC->CR &= ~((uint32_t)RCC_CR_PLLI2SON);
    
    /* PLLI2S clock used as I2S clock source */
    RCC->CFGR &= ~RCC_CFGR_I2SSRC;
    
    /* Configure PLLI2S */
    RCC->PLLI2SCFGR = (plli2sN << 6) | (plli2sR << 28);
    
    /* Enable PLLI2S */
    RCC->CR |= ((uint32_t)RCC_CR_PLLI2SON);
    
    /* Wait till PLLI2S is ready */
    while((RCC->CR & RCC_CR_PLLI2SRDY) == 0)
    {
    }  
  }
  
  /* CODEC_I2S peripheral configuration */
  I2S_InitStructure.I2S_AudioFreq = AudioFreq;
  I2S_InitStructure.I2S_Standard = I2S_STANDARD;
  I2S_InitStructure.I2S_DataFormat = I2S_DataFormat_16b;
  I2S_InitStructure.I2S_CPOL = I2S_CPOL_Low;
  I2S_InitStructure.I2S_Mode = I2S_Mode_MasterTx;
#ifdef CODEC_MCLK_ENABLED
  I2S_InitStructure.I2S_MCLKOutput = I2S_MCLKOutput_Enable;
#elif defined(CODEC_MCLK_DISABLED)
  I2S_InitStructure.I2S_MCLKOutput = I2S_MCLKOutput_Disable;
#else
 #error "No selection for the MCLK output has been defined !"
#endif /* CODEC_MCLK_ENABLED */

  /* Initialize the I2S peripheral with the structure above */
#ifdef USE_I2S_DYNAMIC_INIT
    I2S_InitExt(CODEC_I2S, &I2S_InitStructure, (uint32_t)((ExtClk)? ExtClk:I2SSrcClkVal));
#else
  I2S_Init(CODEC_I2S, &I2S_InitStructure);  
#endif /* USE_I2S_DYNAMIC_INIT */

  /* Enable the I2S DMA TX request */
  SPI_I2S_DMACmd(CODEC_I2S, SPI_I2S_DMAReq_Tx, ENABLE);

  /* The I2S peripheral will be enabled only in the EVAL_AUDIO_Play() function 
       or by user functions if DMA mode not enabled */  
}

/**
  * @brief Restores the Audio Codec audio interface to its default state.
  * @param  None.
  * @retval None.
  */
static void Codec_AudioInterface_DeInit(void)
{
  /* Disable the CODEC_I2S peripheral (in case it hasn't already been disabled) */
  I2S_Cmd(CODEC_I2S, DISABLE);
  
  /* Deinitialize the CODEC_I2S peripheral */
  SPI_I2S_DeInit(CODEC_I2S);
  
  /* Disable the CODEC_I2S peripheral clock */
  RCC_APB1PeriphClockCmd(CODEC_I2S_CLK, DISABLE); 
}

/**
  * @brief Initializes IOs used by the Audio Codec (on the control and audio 
  *        interfaces).
  * @param  None.
  * @retval None.
  */
static void Codec_GPIO_Init(void)
{
   GPIO_InitTypeDef GPIO_InitStructure;
  
  /* Enable I2S and I2C GPIO clocks */
  RCC_AHB1PeriphClockCmd(CODEC_I2C_GPIO_CLOCK | CODEC_I2S_GPIO_CLOCK, ENABLE);
  
  /* CODEC_I2C SCL and SDA pins configuration -------------------------------------*/
  /* If the I2C peripheral is already enabled, don't reconfigure it */
  if (CODEC_I2C->CR1 & I2C_CR1_PE)
  { 
    GPIO_InitStructure.GPIO_Pin = CODEC_I2C_SCL_PIN | CODEC_I2C_SDA_PIN; 
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_InitStructure.GPIO_OType = GPIO_OType_OD;
    GPIO_InitStructure.GPIO_PuPd  = GPIO_PuPd_NOPULL;
    GPIO_Init(CODEC_I2C_GPIO, &GPIO_InitStructure);     
    /* Connect pins to Periph */
    GPIO_PinAFConfig(CODEC_I2C_GPIO, CODEC_I2S_SCL_PINSRC, CODEC_I2C_GPIO_AF);  
    GPIO_PinAFConfig(CODEC_I2C_GPIO, CODEC_I2S_SDA_PINSRC, CODEC_I2C_GPIO_AF);  
  }
  
  /* CODEC_I2S pins configuraiton: WS, SCK and SD pins -----------------------------*/
  GPIO_InitStructure.GPIO_Pin = CODEC_I2S_WS_PIN | CODEC_I2S_SCK_PIN | CODEC_I2S_SD_PIN; 
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_25MHz;
  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
  GPIO_Init(CODEC_I2S_GPIO, &GPIO_InitStructure);     
  /* Connect pins to Periph */
  GPIO_PinAFConfig(CODEC_I2S_GPIO, CODEC_I2S_WS_PINSRC, CODEC_I2S_GPIO_AF);  
  GPIO_PinAFConfig(CODEC_I2S_GPIO, CODEC_I2S_SCK_PINSRC, CODEC_I2S_GPIO_AF);
  GPIO_PinAFConfig(CODEC_I2S_GPIO, CODEC_I2S_SD_PINSRC, CODEC_I2S_GPIO_AF);

